# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)

# area_list = [
    # [ "ТИК ЖД", "пер. Трамвайный, д.1, каб. 14А ", "+7 (4862) 55-38-72" ],
    # [ "3", "ул.Революции, д.4", "+7 (4862) 55-86-73, +7 (4862) 54-36-73" ],
    # [ "6", "ул.Пушкина, д.80", "+7 (4862) 55-41-67" ],
    # [ "7", "ул.Пушкина, д.80 ", "+7 (4862) 55-41-67, +7 (4862) 55-14-14" ],
    # [ "9", "ул.5 Августа, д.25", "+7 (4862) 54-27-32" ],
    # [ "10", "ул.5 Августа, д.25", "+7 (4862) 73-59-49" ],
    # [ "14", "ул.Лесная, д.9", "+7 (4862) 42-86-74" ],
    # [ "20", "ул.Орджоникидзе, д.3", "+7 (4862) 55-49-10" ],
    # [ "21", "пер. Южный, д.26 ", "8 919 260 10 71" ],
    # [ "22", "пер. Южный, д.26 ", "+7 (4862) 55-35-90" ],
    # [ "27", "ул.Льва Толстого, д.6", "+7 (4862) 46-68-73" ],
    # [ "ТИК СЕВ", "Московское шоссе, д.137, корп. 5, каб. 511 ", "+7 (4862) 33-20-43" ],
    # [ "30", "ул.Силикатная, д.22 ", "+7 (4862) 46-91-22" ],
    # [ "31", "ул.Силикатная, д.12 ", "+7 (4862) 46-91-10" ],
    # [ "33", "ул.Маринченко, д.10", "+7 (4862) 33-03-40, +7 (4862) 33-10-53" ],
    # [ "34", "ул.Маринченко, д.10", "+7 (4862) 33-03-40" ],
    # [ "37", "ул.Маринченко, д.9", "+7 (4862) 33-07-32" ],
    # [ "38", "ул.Рощинская, д.33", "+7 (4862) 33-11-22" ],
    # [ "39", "ул.Металлургов, д.42", "+7 (4862) 33-02-27" ],
    # [ "41", "ул.Маринченко, д.9", "+7 (4862) 33-07-32, +7 (4862) 33-07-80" ],
    # [ "42", "ул.Маринченко, д.25", "+7 (4862) 33-01-32, 33-09-10" ],
    # [ "43", "ул.Рощинская, д.33", "+7 (4862) 33-12-91" ],
    # [ "44", "ул.Металлургов, д.42", "+7 (4862) 33-03-01" ],
    # [ "46", "ул.Маринченко, д.25 ", "+7 (4862) 33-09-10" ],
    # [ "47", "ул.Блынского, д.6", "+7 (4862) 33-18-92, +7 (4862) 33-32-77" ],
    # [ "48", "ул.Блынского, д.6", "+7 (4862) 33-18-92" ],
    # [ "50", "ул.Блынского, д.6", "8 910 200 42 50" ],
    # [ "51", "ул.Маринченко, д.9", "8 910 200 42 52" ],
    # [ "52", "ул.Маринченко, д.25", "+7 (4862) 33-09-10" ],
    # [ "ТИК ЗАВ", "ул.1-я Посадская, д.14, каб. 33", "+7 (4862) 55-18-80, +7 (4862) 55-88-62" ],
    # [ "54", "ул.Черкасская, д.81", "+7 (4862) 75-25-22" ],
    # [ "65", "ул.Комсомольская, д.182", "+7 (4862) 59-18-72" ],
    # [ "68", "ул.Васильевская, д.151", "+7 (4862) 72-17-31" ],
    # [ "69", "ул.Васильевская, д.151", "+7 (4862) 72-17-31" ],
    # [ "72", "ул.Латышских стрелков, д.103", "+7 (4862) 77-10-57" ],
    # [ "73", "ул.Комсомольская, д.182 ", "+7 (4862) 59-18-72" ],
    # [ "74", "ул.Комсомольская, д.182 ", "+7 (4862) 59-18-72" ],
    # [ "77", "ул.Автовокзальная, д.34", "+7 (4862) 72-19-54" ],
    # [ "78", "ул.Латышских стрелков, д.105", "+7 (4862) 77-57-43" ],
    # [ "80", "ул.Комсомольская, д.374 ", "+7 (4862) 72-11-92" ],
    # [ "84", "ул.Планерная, д.55", "+7 (4862) 74-81-06" ],
    # [ "85", "ул.Планерная, д.55", "+7 (4862) 59-31-06" ],
    # [ "86", "ул.Комсомольская, д.374", "+7 (4862) 72-11-92" ],
    # [ "89", "ул.Черкасская, д.81", "+7 (4862) 75-25-22" ],
    # [ "90", "ул.Узловая, д.5", "+7 (4862) 47-60-95, +7 (4862) 47-74-95" ],
    # [ "91", "ул.Узловая, д.5", "+7 (4862) 47-60-95, 7 (4862) 47-74-95" ],
    # [ "95", "ул.Гагарина, д.35А", "+7 (4862) 55-49-64" ],
    # [ "96", "ул.Маяковского, д.55", "+7 (4862) 59-15-77" ],
    # [ "98", "ул.Автовокзальная, д.34", "+7 (4862) 72-19-54" ],
    # [ "100", "ул.Планерная, д.55", "+7 (4862) 59-31-06" ],
    # [ "ТИК СОВ", "ул.Октябрьская, д.30", "+7 (4862) 43-39-23" ],
    # [ "103", "ул.Салтыкова-Щедрина, д.41", "+7 (4862) 76-43-80" ],
    # [ "104", "ул.М.Горького, д.93", "+7 (4862) 47-59-26" ],
    # [ "105", "ул.М.Горького, д.93", "+7 (4862) 47-59-26" ],
    # [ "106", "ул.Пожарная, д.52", "+7 (4862) 41-34-31" ],
    # [ "107", "ул.Пожарная, д.52", "+7 (4862) 42-07-10" ],
    # [ "111", "ул.Игнатова, д.9", "+7 (4862) 41-07-09" ],
    # [ "112", "ул.Игнатова, д.9", "+7 (4862) 41-07-09" ],
    # [ "113", "ул.Игнатова, д.9", "+7 (4862) 41-07-09" ],
    # [ "115", "ул.Матвеева, д.12", "+7 (4862) 41-01-04, +7 (4862) 41-57-47" ],
    # [ "121", "ул.Трудовых резервов, д.32", "+7 (4862) 76-16-02, +7 (4862) 76-19-29" ],
    # [ "125", "ул.Салтыкова-Щедрина, д.31", "+7 (4862) 76-30-15" ],
    # [ "127", "ул.Тургенева, д.44а", "+7 (4862) 76-27-14" ],
    # [ "132", "ул.Трудовых резервов, д.32", "+7 (4862) 76-19-29" ],
    # [ "133", "ул.М. Горького, д.25", "+7 (4862) 76-28-80" ],
    # [ "135", "ул.Картукова, д.8", "+7 (4862) 73-69-57" ]
#   ]
  
# area_list.each do |area_code, address, phone_number|
#     Area.create( area_code: area_code, address: address, phone_number: phone_number )
# end


require 'csv'

csv_text = File.read(Rails.root.join('lib', 'seeds', 'table2.csv'))
csv = CSV.parse(csv_text, :headers => true, :encoding => 'UTF-8', :col_sep => ";" )
csv.each do |row|
    Area.create( area_code: row["area_code"], address: row["address"],
         phone_number: row["phone_number"], latitude: row["latitude"], longitude: row["longitude"] )
  end

puts csv_text

